---
kind: method
id: M:Autodesk.Revit.DB.CombinableElementArray.#ctor
source: html/4aaefe03-1efa-1a7c-a043-340cec1097bf.htm
---
# Autodesk.Revit.DB.CombinableElementArray.#ctor Method

Initializes a new instance of the CombinableElementArray class

## Syntax (C#)
```csharp
public CombinableElementArray()
```